from config import SUPPORT_CHANNEL

HELP_1 = f"""```
❖ ᴧᴅϻɪη ᴄσϻϻᴧηᴅs ❖```
**ᴊυsᴛ ᴧᴅᴅ ᴄ ɪη ᴛʜє sᴛᴧʀᴛɪηɢ σғ ᴛʜє ᴄσϻϻᴧηᴅs ᴛσ υsє ᴛʜєϻ ғσʀ ᴄʜᴧηηєʟ

❍ /pause : ᴩᴧυsє ᴛʜє ᴄυʀʀєηᴛ ᴩʟᴧʏɪηɢ sᴛʀєᴧϻ
❍ /resume : ʀєsυϻє ᴛʜє ᴩᴧυsєᴅ sᴛʀєᴧϻ
❍ /skip : sᴋɪᴩ ᴛʜє ᴄυʀʀєηᴛ ᴩʟᴧʏɪηɢ sᴛʀєᴧϻ ᴧηᴅ sᴛᴧʀᴛ sᴛʀєᴧϻɪηɢ ᴛʜє ηєxᴛ ᴛʀᴧᴄᴋ ɪη ǫυєυє
❍ /end σʀ /stop : ᴄʟєᴧʀs ᴛʜє ǫυєυє ᴧηᴅ єηᴅ ᴛʜє ᴄυʀʀєηᴛ ᴩʟᴧʏɪηɢ sᴛʀєᴧϻ
❍ /player : ɢєᴛ ᴧ ɪηᴛєʀᴧᴄᴛɪᴠє ᴩʟᴧʏєʀ ᴩᴧηєʟ
❍ /queue : sʜσᴡs ᴛʜє ǫυєυєᴅ ᴛʀᴧᴄᴋs ʟɪsᴛ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹  ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ  ˼]({SUPPORT_CHANNEL})**
"""

HELP_2 = f"""```
❖ ᴧυᴛʜ υsєʀs ❖```
**ᴧυᴛʜ υsєʀs ᴄᴧη υsє ᴧᴅϻɪη ʀɪɢʜᴛs ɪη ᴛʜє ʙσᴛ ᴡɪᴛʜσυᴛ ᴧᴅϻɪη ʀɪɢʜᴛs ɪη ᴛʜє ᴄʜᴧᴛ

❍ /auth [υsєʀηᴧϻє/υsєʀ_ɪᴅ] : ᴧᴅᴅ ᴧ υsєʀ ᴛσ ᴧυᴛʜ ʟɪsᴛ σғ ᴛʜє ʙσᴛ
❍ /unauth [υsєʀηᴧϻє/υsєʀ_ɪᴅ] : ʀєϻσᴠє ᴧ ᴧυᴛʜ υsєʀs ғʀσϻ ᴛʜє ᴧυᴛʜ υsєʀs ʟɪsᴛ
❍ /authusers : sʜσᴡs ᴛʜє ʟɪsᴛ σғ ᴧυᴛʜ υsєʀs σғ ᴛʜє ɢʀσυᴩ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼ ]({SUPPORT_CHANNEL})**
"""

HELP_3 = f"""```
❖ ʙʀσᴧᴅᴄᴧsᴛ ғєᴧᴛυʀє [σηʟʏ ғσʀ sυᴅσєʀs] ❖```
**/broadcast [ϻєssᴧɢє σʀ ʀєᴩʟʏ ᴛσ ᴧ ϻєssᴧɢє] : ʙʀσᴧᴅᴄᴧsᴛ ᴧ ϻєssᴧɢє ᴛσ sєʀᴠєᴅ ᴄʜᴧᴛs σғ ᴛʜє ʙσᴛ
```
❖ ʙʀσᴧᴅᴄᴧsᴛɪηɢ ϻσᴅєs ❖

❍ -pin : ᴩɪηs ʏσυʀ ʙʀσᴧᴅᴄᴧsᴛєᴅ ϻєssᴧɢєs ɪη sєʀᴠєᴅ ᴄʜᴧᴛs
❍ -pinloud : ᴩɪηs ʏσυʀ ʙʀσᴧᴅᴄᴧsᴛєᴅ ϻєssᴧɢє ɪη sєʀᴠєᴅ ᴄʜᴧᴛs ᴧηᴅ sєηᴅ ησᴛɪғɪᴄᴧᴛɪση ᴛσ ᴛʜє ϻєϻʙєʀs
❍ -user : ʙʀσᴧᴅᴄᴧsᴛs ᴛʜє ϻєssᴧɢє ᴛσ ᴛʜє υsєʀs ᴡʜσ ʜᴧᴠє sᴛᴧʀᴛєᴅ ʏσυʀ ʙσᴛ
❍ -assistant : ʙʀσᴧᴅᴄᴧsᴛ ʏσυʀ ϻєssᴧɢє ғʀσϻ ᴛʜє ᴧssɪᴛᴧηᴛ ᴧᴄᴄσυηᴛ σғ ᴛʜє ʙσᴛ
❍ -nobot : ғσʀᴄєs ᴛʜє ʙσᴛ ᴛσ ησᴛ ʙʀσᴧᴅᴄᴧsᴛ ᴛʜє ϻєssᴧɢє```

❖ єxᴧϻᴩʟє:</b> <code>/broadcast -user -assistant -pin ᴛєsᴛɪηɢ ʙʀσᴧᴅᴄᴧsᴛ</code>

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ  ˼]({SUPPORT_CHANNEL})**
"""

HELP_4 = f"""```
❖ ᴄʜᴧᴛ ʙʟᴧᴄᴋʟɪsᴛ ғєᴧᴛυʀє ❖```
**ʀєsᴛʀɪᴄᴛ sʜɪᴛ ᴄʜᴧᴛs ᴛσ υsє συʀ ᴘʀєᴄɪσυs ʙσᴛ

❍ /blacklistchat [ᴄʜᴧᴛ ɪᴅ] : ʙʟᴧᴄᴋʟɪsᴛ ᴧ ᴄʜᴧᴛ ғʀσϻ υsɪηɢ ᴛʜє ʙσᴛ
❍ /whitelistchat [ᴄʜᴧᴛ ɪᴅ] : ᴡʜɪᴛєʟɪsᴛ ᴛʜє ʙʟᴧᴄᴋʟɪsᴛєᴅ ᴄʜᴧᴛ
❍ /blacklistedchat : sʜσᴡs ᴛʜє ʟɪsᴛ σғ ʙʟᴧᴄᴋʟɪsᴛєᴅ ᴄʜᴧᴛs

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_5 = f"""```
❖ ʙʟσᴄᴋ υsєʀs ❖```
**sᴛᴧʀᴛs ɪɢησʀɪηɢ ᴛʜє ʙʟᴧᴄᴋʟɪsᴛєᴅ υsєʀ, sσ ᴛʜᴧᴛ ʜє ᴄᴧη'ᴛ υsє ʙσᴛ ᴄσϻϻᴧηᴅs

❍ /block [υsєʀηᴧϻє σʀ ʀєᴩʟʏ ᴛσ ᴧ υsєʀ] : ʙʟσᴄᴋ ᴛʜє υsєʀ ғʀσϻ συʀ ʙσᴛ
❍ /unblock [υsєʀηᴧϻє σʀ ʀєᴩʟʏ ᴛσ ᴧ υsєʀ] : υηʙʟσᴄᴋs ᴛʜє ʙʟσᴄᴋєᴅ υsєʀ
❍ /blockedusers : sʜσᴡs ᴛʜє ʟɪsᴛ σғ ʙʟσᴄᴋєᴅ υsєʀs.

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_6 = f"""```
❖ ᴄʜᴧηηєʟ ᴩʟᴧʏ ᴄσϻϻᴧηᴅs ❖```
**ʏσυ ᴄᴧη sᴛʀєᴧϻ ᴧυᴅɪσ/ᴠɪᴅєσ ɪη ᴄʜᴧηηєʟ

❍ /cplay : sᴛᴧʀᴛs sᴛʀєᴧϻɪηɢ ᴛʜє ʀєǫυєsᴛєᴅ ᴧυᴅɪσ ᴛʀᴧᴄᴋ ση ᴄʜᴧηηєʟ's ᴠɪᴅєσᴄʜᴧᴛ
❍ /cvplay : sᴛᴧʀᴛs sᴛʀєᴧϻɪηɢ ᴛʜє ʀєǫυєsᴛєᴅ ᴠɪᴅєσ ᴛʀᴧᴄᴋ ση ᴄʜᴧηηєʟ's ᴠɪᴅєσᴄʜᴧᴛ
❍ /cplayforce or /cvplayforce : sᴛσᴩs ᴛʜє σηɢσɪηɢ sᴛʀєᴧϻ ᴧηᴅ sᴛᴧʀᴛs sᴛʀєᴧϻɪηɢ ᴛʜє ʀєǫυєsᴛєᴅ ᴛʀᴧᴄᴋ
❍ /channelplay [ᴄʜᴧᴛ υsєʀηᴧϻє σʀ ɪᴅ] σʀ [ᴅɪsᴧʙʟє] : ᴄσηηєᴄᴛ ᴄʜᴧηηєʟ ᴛσ ᴧ ɢʀσυᴩ ᴧηᴅ sᴛᴧʀᴛs sᴛʀєᴧϻɪηɢ ᴛʀᴧᴄᴋs ʙʏ ᴛʜє ʜєʟᴩ σғ ᴄσϻϻᴧηᴅs sєηᴛ ɪη ɢʀσυᴩ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_7 = f"""```
❖ ɢʟσʙᴧʟ ʙᴧη ғєᴧᴛυʀє ❖```
**❍ /gban [υsєʀηᴧϻє σʀ ʀєᴩʟʏ ᴛσ ᴧ υsєʀ] : ɢʟσʙᴧʟʟʏ ʙᴧηs ᴛʜє ᴄʜυᴛɪʏᴧ ғʀσϻ ᴧʟʟ ᴛʜє sєʀᴠєᴅ ᴄʜᴧᴛs ᴧηᴅ ʙʟᴧᴄᴋʟɪsᴛ ʜɪϻ ғʀσϻ υsɪηɢ ᴛʜє ʙσᴛ
❍ /ungban [υsєʀηᴧϻє σʀ ʀєᴩʟʏ ᴛσ ᴧ υsєʀ] : ɢʟσʙᴧʟʟʏ υηʙᴧηs ᴛʜє ɢʟσʙᴧʟʟʏ ʙᴧηηєᴅ υsєʀ
❍ /gbannedusers : sʜσᴡs ᴛʜє ʟɪsᴛ σғ ɢʟσʙᴧʟʟʏ ʙᴧηηєᴅ υsєʀs

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_8 = f"""```
❖ ʟσσᴘ sᴛʀєᴧϻ ❖```
**sᴛᴧʀᴛs sᴛʀєᴧϻɪηɢ ᴛʜє σηɢσɪηɢ sᴛʀєᴧϻ ɪη ʟσσᴘ

❍ /loop [enable/disable] : єηᴧʙʟєs/ᴅɪsᴧʙʟєs ʟσσᴘ ғσʀ ᴛʜє σηɢσɪηɢ sᴛʀєᴧϻ
❍ /loop [1, 2, 3, ...] : єηᴧʙʟєs ᴛʜє ʟσσᴘ ғσʀ ᴛʜє ɢɪᴠєη ᴠᴧʟυє

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_9 = f"""```
❖ ϻᴧɪηᴛєηᴧηᴄє ϻσᴅє ❖```
**❍ /logs : ɢєᴛ ʟσɢs σғ ᴛʜє ʙσᴛ
❍ /logger [єηᴧʙʟє/ᴅɪsᴧʙʟє] : ʙσᴛ ᴡɪʟʟ sᴛᴧʀᴛ ʟσɢɢɪηɢ ᴛʜє ᴧᴄᴛɪᴠɪᴛɪєs ʜᴧᴩᴩєη ση ʙσᴛ
❍ /maintenance [єηᴧʙʟє/ᴅɪsᴧʙʟє] : єηᴧʙʟє σʀ ᴅɪsᴧʙʟє ᴛʜє ϻᴧɪηᴛєηᴧηᴄє ϻσᴅє σғ ʏσυʀ ʙσᴛ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_10 = f"""```
❖ ᴘɪηɢ & sᴛᴧᴛs ❖```
**❍ /start : sᴛᴧʀᴛs ᴛʜє ϻυsɪᴄ ʙσᴛ
❍ /help : ᴛᴧʙ ᴛσ sєє ʜєʟᴘ ϻєηυ
❍ /ping : sʜσᴡs ᴛʜє ᴩɪηɢ ᴧηᴅ sʏsᴛєϻ sᴛᴧᴛs σғ ᴛʜє ʙσᴛ
❍ /stats : sʜσᴡs ᴛʜє σᴠєʀᴧʟʟ sᴛᴧᴛs σғ ᴛʜє ʙσᴛ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_11 = f"""```
❖ ᴩʟᴧʏ ᴄσϻϻᴧηᴅs ❖```
```
V : sᴛᴧηᴅs ғσʀ ᴠɪᴅєσ ᴩʟᴧʏ
FORCE : sᴛᴧηᴅs ғσʀ ғσʀᴄє ᴩʟᴧʏ```
**❍ /play σʀ /vplay : sᴛᴧʀᴛs sᴛʀєᴧϻɪηɢ ᴛʜє ʀєǫυєsᴛєᴅ ᴛʀᴧᴄᴋ ση ᴠɪᴅєσᴄʜᴧᴛ
❍ /playforce σʀ /vplayforce : sᴛσᴩs ᴛʜє σηɢσɪηɢ sᴛʀєᴧϻ ᴧηᴅ sᴛᴧʀᴛs sᴛʀєᴧϻɪηɢ ᴛʜє ʀєǫυєsᴛєᴅ ᴛʀᴧᴄᴋ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_12 = f"""```
❖ sʜυғғʟє σ̨υєυє ❖```
**❍ /shuffle : sʜυғғʟє's ᴛʜє σ̨υєυє.
❍ /queue : sʜσᴡs ᴛʜє sʜυғғʟєᴅ σ̨υєυє

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_13 = f"""```
❖ sєєᴋ sᴛʀєᴧϻ ❖```
**❍ /seek [ᴅυʀᴧᴛɪση ɪη sєᴄσηᴅs] : sєєᴋ ᴛʜє sᴛʀєᴧϻ ᴛσ ᴛʜє ɢɪᴠєη ᴅυʀᴧᴛɪση
❍ /seekback [ᴅυʀᴧᴛɪση ɪη sєᴄσηᴅs] : ʙᴧᴄᴋᴡᴧʀᴅ sєєᴋ ᴛʜє sᴛʀєᴧϻ ᴛσ ᴛʜє ᴛʜє ɢɪᴠєη ᴅυʀᴧᴛɪση

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_14 = f"""```
❖ sσηɢ ᴅσᴡηʟσᴧᴅ ❖```
**❍ /song [sσηɢ ηᴧϻє/ʏᴛ υʀʟ] : ᴅσᴡηʟσᴧᴅ ᴧηʏ ᴛʀᴧᴄᴋ ғʀσϻ ʏσυᴛυʙє ɪη ϻᴘ3 σʀ ϻᴘ4 ғσʀϻᴧᴛs

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""

HELP_15 = f"""```
❖ sᴘєєᴅ ᴄσϻϻᴧηᴅs ❖```
**ʏσυ ᴄᴧη ᴄσηᴛʀσʟ ᴛʜє ᴘʟᴧʏʙᴧᴄᴋ sᴘєєᴅ σғ ᴛʜє σηɢσɪηɢ sᴛʀєᴧϻ. [ᴧᴅϻɪηs σηʟʏ]

❍ /speed or /playback : ғσʀ ᴧᴅᴊυsᴛɪηɢ ᴛʜє ᴧυᴅɪσ ᴘʟᴧʏʙᴧᴄᴋ sᴘєєᴅ ɪη ɢʀσυᴘ
❍ /cspeed or /cplayback : ғσʀ ᴧᴅᴊυsᴛɪηɢ ᴛʜє ᴧυᴅɪσ ᴘʟᴧʏʙᴧᴄᴋ sᴘєєᴅ ɪη ᴄʜᴧηηєʟ

❖ 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [˹ ғᴀɪʀʏᴛᴀʟᴇ ꭙ ɴᴇᴛᴡᴏʀᴋ ˼]({SUPPORT_CHANNEL})**
"""
